/** @file

Copyright (c) 2006 - 2018, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  AtaDriverCfg.uni

Abstract:
  The definition of string used in ATA Devices setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"


#string STR_SATA_FORM                      #language en-US "SATA Configuration"
                                           #language zh-Hans "SATA\wide配置\narrow"
#string STR_SATA_FORM_HELP                 #language en-US "Select this option to see your system's SATA devices."
                                           #language zh-Hans "\wide选择此选项可查看系统的\narrowSATA\wide设备。\narrow"

#string STR_SATA_NVME_DEVICE_VALUE                    #language en-US "%a SN:%a Size:%dGB"
                                                      #language zh-Hans "%a \wide序列号\narrow:%a \wide大小\narrow:%dGB"
#string STR_SATA_ATAPI_HDD_DEVICE_VALUE               #language en-US "[%s] %a %dGB, FW:%a, RR:%a, Speed:%a"
                                                      #language zh-Hans "[%s] %a %dGB, \wide固件\narrow:%a, \wide转速\narrow:%a, \wide速度\narrow:%a"
#string STR_SATA_ATAPI_SSD_DEVICE_VALUE               #language en-US "[%s] %a %dGB, FW:%a, Speed:%a"
                                                      #language zh-Hans "[%s] %a %dGB, \wide固件\narrow:%a, \wide速度\narrow:%a"
#string STR_SATA_OTHER_DEVICE_VALUE                   #language en-US "[ODD] %a, FW:%a, Speed:%a"
                                                      #language zh-Hans "[ODD] %a, \wide固件\narrow:%a, \wide速度\narrow:%a"
#string STR_SATA_ASMEDIA_DEVICE_VALUE                   #language en-US "%a\nFW:%a, Speed:%a"
                                                      #language zh-Hans "%a\n\wide固件\narrow:%a, \wide速度\narrow:%a"
													  
#string STR_SATA_AHCI_DEVICE_VALUE                    #language en-US "%a"
                                                      #language zh-Hans "%a"

#string STR_SATA_NUMBER                               #language en-US "Number of SATA hard disks:"
                                                      #language zh-Hans "SATA\wide硬盘数量\narrow:"
#string STR_SATA_NUMBER_VALUE                         #language en-US "0"
                                                      #language zh-Hans "0"
                                                                                  
#string STR_SATA_DRIVE0_NAME                          #language en-US "SATA Drive 0"
                                                      #language zh-Hans "SATA\wide端口\narrow0"
#string STR_SATA_DRIVE0_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE1_NAME                          #language en-US "SATA Drive 1"
                                                      #language zh-Hans "SATA\wide端口\narrow1"
#string STR_SATA_DRIVE1_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE2_NAME                          #language en-US "SATA Drive 2"
                                                      #language zh-Hans "SATA\wide端口\narrow2"
#string STR_SATA_DRIVE2_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE3_NAME                          #language en-US "SATA Drive 3"
                                                      #language zh-Hans "SATA\wide端口\narrow3"
#string STR_SATA_DRIVE3_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE4_NAME                          #language en-US "SATA Drive 4"
                                                      #language zh-Hans "SATA\wide端口\narrow4"
#string STR_SATA_DRIVE4_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE5_NAME                          #language en-US "SATA Drive 5"
                                                      #language zh-Hans "SATA\wide端口\narrow5"
#string STR_SATA_DRIVE5_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"                                                                                                    
#string STR_SATA_DRIVE6_NAME                          #language en-US "SATA Drive 6"
                                                      #language zh-Hans "SATA\wide端口\narrow6"
#string STR_SATA_DRIVE6_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE7_NAME                          #language en-US "SATA Drive 7"
                                                      #language zh-Hans "SATA\wide端口\narrow7"
#string STR_SATA_DRIVE7_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
                                                      
                                                      
                                                      
#string STR_SATA_DRIVE8_NAME                          #language en-US "SATA Drive 0"
                                                      #language zh-Hans "SATA\wide端口\narrow0"
#string STR_SATA_DRIVE8_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"  
#string STR_SATA_DRIVE9_NAME                          #language en-US "SATA Drive 1"
                                                      #language zh-Hans "SATA\wide端口\narrow1"
#string STR_SATA_DRIVE9_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE10_NAME                         #language en-US "SATA Drive 2"
                                                      #language zh-Hans "SATA\wide端口\narrow2"
#string STR_SATA_DRIVE10_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE11_NAME                         #language en-US "SATA Drive 3"
                                                      #language zh-Hans "SATA\wide端口\narrow3"
#string STR_SATA_DRIVE11_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow" 
#string STR_SATA_DRIVE12_NAME                         #language en-US "SATA Drive 4"
                                                      #language zh-Hans "SATA\wide端口\narrow4"
#string STR_SATA_DRIVE12_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE13_NAME                         #language en-US "SATA Drive 5"
                                                      #language zh-Hans "SATA\wide端口\narrow5"
#string STR_SATA_DRIVE13_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE14_NAME                         #language en-US "SATA Drive 6"
                                                      #language zh-Hans "SATA\wide端口\narrow6"
#string STR_SATA_DRIVE14_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE15_NAME                          #language en-US "SATA Drive 7"
                                                      #language zh-Hans "SATA\wide端口\narrow7"
#string STR_SATA_DRIVE15_VALUE                         #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
                                                      
                                                      
                                                      
                                                      
                                                      
                                                      
#string STR_SATA_DRIVE16_NAME                         #language en-US "SATA Drive 0"
                                                      #language zh-Hans "SATA\wide端口\narrow0"
#string STR_SATA_DRIVE16_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE17_NAME                         #language en-US "SATA Drive 1"
                                                      #language zh-Hans "SATA\wide端口\narrow1"
#string STR_SATA_DRIVE17_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"                                                                                                    
#string STR_SATA_DRIVE18_NAME                         #language en-US "SATA Drive 2"
                                                      #language zh-Hans "SATA\wide端口\narrow2"
#string STR_SATA_DRIVE18_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE19_NAME                         #language en-US "SATA Drive 3"
                                                      #language zh-Hans "SATA\wide端口\narrow3"
#string STR_SATA_DRIVE19_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE20_NAME                         #language en-US "SATA Drive 4"
                                                      #language zh-Hans "SATA\wide端口\narrow4"
#string STR_SATA_DRIVE20_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"  
#string STR_SATA_DRIVE21_NAME                         #language en-US "SATA Drive 5"
                                                      #language zh-Hans "SATA\wide端口\narrow5"
#string STR_SATA_DRIVE21_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE22_NAME                         #language en-US "SATA Drive 6"
                                                      #language zh-Hans "SATA\wide端口\narrow6"
#string STR_SATA_DRIVE22_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE23_NAME                         #language en-US "SATA Drive 7"
                                                      #language zh-Hans "SATA\wide端口\narrow7"
#string STR_SATA_DRIVE23_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow" 
                                                      
                                                                                                        
#string STR_SATA_DRIVE24_NAME                         #language en-US "  SATA Drive 0"
                                                      #language zh-Hans "  SATA\wide端口\narrow0"
#string STR_SATA_DRIVE24_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE25_NAME                         #language en-US "  SATA Drive 1"
                                                      #language zh-Hans "  SATA\wide端口\narrow1"
#string STR_SATA_DRIVE25_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE26_NAME                         #language en-US "SATA Drive 2"
                                                      #language zh-Hans "SATA\wide端口\narrow2"
#string STR_SATA_DRIVE26_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE27_NAME                         #language en-US "SATA Drive 3"
                                                      #language zh-Hans "SATA\wide端口\narrow3"
#string STR_SATA_DRIVE27_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE28_NAME                         #language en-US "SATA Drive 4"
                                                      #language zh-Hans "SATA\wide端口\narrow4"
#string STR_SATA_DRIVE28_VALUE                        #language en-US "AHCI Mode"
                                                      #language zh-Hans "AHCI \wide模式\narrow"
#string STR_SATA_DRIVE29_NAME                         #language en-US "SATA Drive 5"
                                                      #language zh-Hans "SATA\wide端口\narrow5"
#string STR_SATA_DRIVE29_VALUE                        #language en-US "AHCI Mode"
                                                      #language zh-Hans "AHCI \wide模式\narrow"                                                                                                    
#string STR_SATA_DRIVE30_NAME                         #language en-US "SATA Drive 6"
                                                      #language zh-Hans "SATA\wide端口\narrow6"
#string STR_SATA_DRIVE30_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"
#string STR_SATA_DRIVE31_NAME                         #language en-US "SATA Drive 7"
                                                      #language zh-Hans "SATA\wide端口\narrow7"
#string STR_SATA_DRIVE31_VALUE                        #language en-US "Not Present"
                                                      #language zh-Hans "\wide未安装\narrow"

                                                      
#string STR_SATA_HOST0                                #language en-US "SATA Controller 1"
                                                      #language zh-Hans "SATA\wide控制器\narrow1"
#string STR_SATA_HOST1                                #language en-US "SATA Controller 2"
                                                      #language zh-Hans "SATA\wide控制器\narrow2"
#string STR_SATA_HOST2                                #language en-US "SATA Controller 3"
                                                      #language zh-Hans "SATA\wide控制器\narrow3"
#string STR_SATA_HOST3                                #language en-US "SATA Controller 4"
                                                      #language zh-Hans "SATA\wide控制器\narrow4"
#string STR_M2_PORT0                                  #language en-US "  M.2 Driver 0"
                                                      #language zh-Hans "  M.2\wide端口\narrow0"   
#string STR_M2_PORT1                                  #language en-US "  M.2 Driver 1"
                                                      #language zh-Hans "  M.2\wide端口\narrow1"  																											
                                                      
#string STR_ASMEDIA_CONTROLLER                        #language en-US "Asmedia Controller"
                                                      #language zh-Hans "Asmedia\wide控制器\narrow"
#string STR_SATA_HOST                                #language en-US "SATA Controller"
                                                      #language zh-Hans "SATA\wide控制器\narrow"
                                                      
#string STR_ASMEDIA_MODE                                #language en-US "Current Asmedia Mode"
                                                      #language zh-Hans "\wide当前\narrowAsmedia\wide模式\narrow"
#string STR_ASMEDIA_MODE_AHCI                          #language en-US "AHCI Mode"
                                                      #language zh-Hans "AHCI\wide模式\narrow"
#string STR_ASMEDIA_MODE_RAID                          #language en-US "RAID Mode"
                                                      #language zh-Hans "RAID\wide模式\narrow"
#string STR_ASMEDIA_MODE_RAID_M2                     #language en-US "1061R_B"
                                                      #language zh-Hans "1061R_B"	
#string STR_ASMEDIA_MODE_RAID_SATA                     #language en-US "1061R_A"
                                                      #language zh-Hans "1061R_A"														  